# WaterTintColor Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Water..::..WaterTintColor Property
Water Class See Also
---
The property labeled "Custom Color" from the "Water" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string WaterTintColor { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WaterTintColor As String
	Get
```

Visual C++
---
```text
public:
static property String^ WaterTintColor {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
# See Also
Water Class
Autodesk.Revit.DB.Visual Namespace